Revit 2017 API
Rebar.TopFinishingTurns Property
 For a spiral, the number of finishing turns at the upper end of the spiral.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2009
Syntax
C#
public int TopFinishingTurns { get; set; }
Visual Basic
Public Property TopFinishingTurns As Integer
	Get
	Set
Visual C++
public:
property int TopFinishingTurns {
	int get ();
	void set (int value);
}
Remarks
 Applies only to instances where RebarShape.Definition is of type RebarShapeDefinitionByArc, and its Type property is equal to the value RebarShapeDefinitionByArcType.Spiral.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: turns must be between 0 and 100.
Autodesk.Revit.Exceptions.DisabledDisciplineException |  When setting this property: None of the following disciplines is enabled: Structural.
Autodesk.Revit.Exceptions.InvalidOperationException |  This Rebar is not an instance of a spiral shape.
See Also
Rebar Class
Autodesk.Revit.DB.Structure Namespace